[net]
width=640
height=640
channels=3
letter_box=1

# Conv

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=silu

# C2f

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=silu

[c2f]
n=1
shortcut=1
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=0
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=silu

# C2f

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[c2f]
n=2
shortcut=1
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=silu

# C2f

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

[c2f]
n=2
shortcut=1
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=512
size=3
stride=2
pad=1
activation=silu

# C2f

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=0
activation=silu

[c2f]
n=1
shortcut=1
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=0
activation=silu

# SPPF

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

[maxpool]
stride=1
size=5

[maxpool]
stride=1
size=5

[maxpool]
stride=1
size=5

[route]
layers=-4, -3, -2, -1

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=0
activation=silu

# Upsample

[upsample]
stride=2

# Concat

[route]
layers=-1, 12

# C2f

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

[c2f]
n=1
shortcut=0
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

# Upsample

[upsample]
stride=2

# Concat

[route]
layers=-1, 8

# C2f

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

[c2f]
n=1
shortcut=0
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=0
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=silu

# Concat

[route]
layers=-1, 27

# C2f

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

[c2f]
n=1
shortcut=0
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=silu

# Conv

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=silu

# Concat

[route]
layers=-1, 22

# C2f

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=0
activation=silu

[c2f]
n=1
shortcut=0
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=0
activation=silu

# Detect

[route]
layers=32

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[convolutional]
filters=80
size=1
stride=1
pad=0
activation=linear

[route]
layers=-4

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[convolutional]
filters=64
size=1
stride=1
pad=0
activation=linear

[route]
layers=-1, -5

[shuffle]
reshape=144, -1

[route]
layers=37

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[convolutional]
filters=80
size=1
stride=1
pad=0
activation=linear

[route]
layers=-4

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[convolutional]
filters=64
size=1
stride=1
pad=0
activation=linear

[route]
layers=-1, -5

[shuffle]
reshape=144, -1

[route]
layers=42

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[convolutional]
filters=80
size=1
stride=1
pad=0
activation=linear

[route]
layers=-4

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[convolutional]
filters=64
size=1
stride=1
pad=0
activation=linear

[route]
layers=-1, -5

[shuffle]
reshape=144, -1

[route]
layers=-21, -11, -1
axis=1

[detect_v8]
num=64
classes=80
